// Бодлого 1. Гурвалжин - Өгөгдсөн гурвалжны периметрийг ол.

var a = 3;
var b = 4; 
var c = 5;

var p = a + b + c;
console.log("1-р бодлогын хариу " + p);


// Бодлого 2. 2 тооны нийлбэр - Өгөгдсөн бүхэл тооны нийлбэрийг ол.

var d = 12;
var f = 23;

var hoyorNiilber = d + f;
console.log("2-р бодлогын хариу " + hoyorNiilber);


// Бодлого 3. Куб - Өгөгдсөн кубын эзэлхүүн ба гүйцэд гадаргуугийн талбайг ол.

var g = 5; 
var cubeS = g * g * g;
var cubeP = (g * g) * 6;

console.log("3-р бодлогын хариу: S нь " + cubeS + " P нь " + cubeP);

// Бодлого 4. Тэгш өнцөгт - Тэгш өнцөгтийн урт ба өргөн нь бүхэл тоон утгаар нэг мөрөнд зайгаар тусгаарлагдан өгөгдөнө. 

var h = 6; 
var j = 4;
var tegshS = h * j;
var tegshP = (h + j) * 2;

console.log("4-р бодлогын хариу: S нь " + tegshS + " P нь " + tegshP);

// Бодлого 5. Функц 1 - y=3x-5 x бүхэл тоон утгаар өгөгдөнө.

var x = 1;
var y = 3 * x - 5;

console.log("5-р бодлогын хариу: " + y);

// Бодлого 6. Функц 2 - y=3x-5 x бүхэл тоон утгаар өгөгдөнө.